Repository: jhotta/dd-omegat
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: "events": [] }
ja: [fuzzy]イベント

source: "requests": [
ja: [fuzzy]要求(R)

source: # Configuration
ja: [fuzzy]{0} の構成

source: # Installation
ja: [fuzzy]インストール

source: # Metrics
ja: [fuzzy]メトリックス

source: # Overview
ja: [fuzzy]概要

source: # Validation
ja: [fuzzy]妥当性検査

source: #authentication
ja: 認証

source: #errors
ja: [fuzzy]エラー

source: #metrics
ja: [fuzzy][fuzzy]メトリックス

source: **a maximum length of 50 characters**
ja: **最大50文字の長さ**に制限されます

source: **a maximum length of 5000 bytes**
ja: **最大長は5000バイト**に制限されます

source: **must be lowercase, alphanumeric characters**
ja: **小文字と英数字**である必要があります

source: Arguments
ja: [fuzzy]引数(A):

source: Response
ja: レスポンス</ h5>

source: A particular query to a service.
ja: サービスへの特定なクエリ。

source: Additional Information
ja: 追加情報

source: Additional resources
ja: その他のリソース

source: Additionally, some configuration options may be set as environment variables.
ja: さらに、いくつかの構成オプションを環境変数として設定することができます。

source: Agent Source
ja: Agentのソースコード

source: Amazon Billing allows you to track your AWS infrastructure billing forecasts and costs.
ja: Amazon Billingでは、AWSインフラストラクチャの請求予測と費用を追跡できます。

source: Checks
ja: [fuzzy]{0} を検査中...

source: Compatibility
ja: 互換性

source: Configuration
ja: 設定

source: Connection refused
ja: 接続拒否

source: Currently, only Go 1.7 is supported.
ja: 現在、Go 1.7のみがサポート対象です。

source: Currently, tracing is only supported by version 5.11.0 (or above) of the Datadog Agent running on Linux and Docker.
ja: 現在、トレースは、LinuxおよびDocker環境上で動作するDatadog Agentのバージョン5.11.0（またはそれ以上）でサポートされています。

source: Data Retention
ja: データ保持期間

source: Datadog's APM allows you to collect performance metrics by tracing your code to determine which parts of your application are slow or inefficient.
ja: DatadogのAPMを使用すると、コードをトレースしてパフォーマンスメトリックスを収集することができます。これらメトリックスを把握することによりアプリケーションのどの部分が遅く、非効率かを判断することができます。

source: Datadog's integrated APM tool eliminates the traditional separation between infrastructure and application performance monitoring.
ja: Datadogに統合されたAPMツールは、従来の監視システムにぞんざいしていたインフラストラクチャとアプリケーションのパフォーマンス監視の壁を取り除きました。

source: Each of the metrics retrieved from AWS will be assigned the same tags that appear in the AWS console, including but not limited to host name, security-groups, and more.
ja: AWSから取得した各メトリックスには、AWSコンソールに表示されるタグと同じものが割り当てられます（ホスト名、セキュリティグループなどです）。

source: Each span consists of a start time, a duration, and optional tags.
ja: 各スパンは、開始時間、継続時間、およびオプションのタグで構成されます。

source: Each trace consists of one or more spans.
ja: 各トレースは、1つまたは複数のスパンから構成されます。

source: Enable the APM in the Datadog Agent configuration file
ja: Datadog Agent構成ファイルでAPMを有効にする

source: Enable this integration to see in Datadog all your Billing metrics.
ja: このインテグレーションを有効にすると、Datadogですべての課金指標が表示されます。

source: Even though the request may require multiple resources and machines to handle the request, all of these function calls and sub-requests would be encapsulated within a single trace.
ja: 要求が複数のリソースとマシンで要求を処理する必要がある場合でも、これらの関数呼び出しとサブ要求はすべて単一のトレース内にカプセル化されます。

source: Example
ja: サンプル

source: Finally, import the tracer and instrument your code!
ja: 最後に、トレーサをインポートしてコードを設定します。

source: For Docker, you will likely need to specify the host or ip address.
ja: 従って、Docker環境の場合は、ホストまたはIPアドレスを指定する必要があります。

source: For a sql database, a resource would be the sql of the query itself like .
ja: SQLデータベースの場合、リソースはクエリ自体のSQLと同じです。

source: For a web application, some examples might be a canonical URL like or a handler function like (often referred to as "routes" in MVC frameworks).
ja: Webアプリケーションの場合、標準的なURLやハンドラ関数（MVCフレームワークでは「ルート」と呼ばれることが多い）の例があります。

source: For additional help from Datadog staff and other Datadog community members, join the [*apm* channel](https://datadoghq.slack.com/messages/apm) in our Datadog Slack.
ja: Datadogのスタッフや他のDatadogコミュニティのメンバーの助けを借りたい場合は、Datadog Slackの[* apm * channel]（https://datadoghq.slack.com/messages/apm）に参加してください。

source: For additional information, please reference [the project README on Github](https://github.com/DataDog/docker-dd-agent/blob/master/README.md#tracing--apm)
ja: 詳細については、[Githubのプロジェクト内のREADME]（https://github.com/DataDog/docker-dd-agent/blob/master/README.md#tracing--apm）を参照してください。

source: For another example, see the [](https://github.com/DataDog/dd-trace-go/blob/master/tracer/example_test.go) file in the Go Tracer package
ja: 別の例として、Goトレーサパッケージの[]（https://github.com/DataDog/dd-trace-go/blob/master/tracer/example_test.go）ファイルを参照してください。

source: For example, a span can describe the time spent on a distributed call on a separate machine, or the time spent in a small component within a larger operation.
ja: たとえば、あるスパンでは、別のマシンで分散呼び出しに費やされた時間、または大きな操作の中の小さなコンポーネントで費やされた時間を表すことができます。

source: For example, a trace can be used to track the entire time spent processing a complicated web request.
ja: たとえば、複雑なWeb要求を処理するために費やされる時間全体を追跡するためにトレースを使用できます。

source: For example: tracer.configure(hostname="172.17.0.1")
ja: 例： tracer.configure（hostname = "172.17.0.1"）

source: For information on tracing these libraries, see [the RubyDoc documentation](http://www.rubydoc.info/gems/ddtrace#Other_libraries)
ja: これらのライブラリのトレースについては、[The RubyDoc documentation]（http://www.rubydoc.info/gems/ddtrace#Other_libraries）を参照してください。

source: For instance, a simple web application may consist of two services: a single service and a single service, while a more complex environment may break it out into 6 services: 3 separate , , and services, along with a , a , and a external service.
ja: たとえば、単純なWebアプリケーションは、単一のサービスと単一のサービスの2つのサービスで構成されますが、より複雑な環境では、3つのサービス、a、a、および外部サービス。

source: For more examples, see the [Getting Started section of library documentation](http://pypi.datadoghq.com/trace/docs/#get-started).
ja: その他の例については、ライブラリに関するのドキュメントの[Getting Startedのセクション](http://pypi.datadoghq.com/trace/docs/#get-started)を参照してください。

source: For more examples, see the [RubyDoc Gem documentation](http://www.rubydoc.info/gems/ddtrace/#Advanced_usage).
ja: その他の例については、[RubyDoc Gem documentation]（http://www.rubydoc.info/gems/ddtrace/#Advanced_usage）を参照してください。

source: For more info see [the docker-dd-agent documentation](https://github.com/DataDog/docker-dd-agent/blob/master/README.md#tracing--apm)
ja: 詳細は[docker-dd-agentのドキュメント]（https://github.com/DataDog/docker-dd-agent/blob/master/README.md#tracing--apm）を参照してください。

source: For more information about the Datadog Agent, see the [Getting Started guide](/guides/basic_agent_usage/) or refer to the [ file](https://github.com/DataDog/dd-agent/blob/master/datadog.conf.example).
ja: Datadog Agentの詳細については、[Getting Startedガイド]（/ guides / basic_agent_usage /）を参照するか、[ファイル]（https://github.com/DataDog/dd-agent/blob/master/datadog）を参照してください。 conf.example）。

source: For more information about your service, please refer to your agent log.
ja: サービスの詳細については、エージェントのログを参照してください。

source: For more information about your traces, please refer to your agent log.
ja: トレースの詳細については、エージェントのログを参照してください。

source: For more information, please reference [the project on Github](https://github.com/DataDog/heroku-buildpack-datadog)
ja: 詳細については、[Githubのプロジェクト](https://github.com/DataDog/heroku-buildpack-datadog)を参照してください。

source: For now, using functions like day_before is out of scope for the graphical editor so you have to use the JSON editor.
ja: 今のところ、day_beforeのような関数を使うのは、グラフィカルエディタの対象外ですので、JSONエディタを使う必要があります。

source: For now, using functions like hour_before is out of scope for the graphical editor so you have to use the JSON editor.
ja: [fuzzy]今のところ、day_beforeのような関数を使うのは、グラフィカルエディタの対象外ですので、JSONエディタを使う必要があります。

source: For now, using functions like month_before is out of scope for the graphical editor so you have to use the JSON editor.
ja: [fuzzy]今のところ、day_beforeのような関数を使うのは、グラフィカルエディタの対象外ですので、JSONエディタを使う必要があります。

source: For other architectures, you can use the source install (coming soon).
ja: 他のアーキテクチャーを利用している場合は、ソースインストールからインストールすることができます。（近々公開予定）。

source: Getting started
ja: 入門

source: Here is an example of aws.ec2.cpuutilization with the month_before value shown as a thin, solid line.
ja: 次に、aws.ec2.cpuutilizationの例を示します。この例では、month_before値が細い実線で示されています。

source: Here is an example of nginx.net.connections with the day_before value shown as a lighter, thinner line.
ja: 次に、nginx.net.connectionsのday_before値を軽く細い線として表示した例を示します。

source: Here is the JSON for this graph:
ja: このグラフのJSONは次のとおりです。

source: Heroku
ja: Herokuのサポート

source: Heroku support is currently provided by the Datadog Heroku Buildpack.
ja: Herokuサポートは、Datadog Heroku Buildpackによって提供されています。

source: If delivery fails, a 500 status code and an error message will be returned.
ja: 配信に失敗すると、500のステータスコードとエラーメッセージが返されます。

source: If you're receiving in your application logs, either the trace functionality is not running or your application is having trouble connecting to the Datadog Agent.
ja: アプリケーションログを受け取っていない場合は、トレース機能が実行されていないか、アプリケーションからDatadog Agentへの接続に問題があります。

source: In order to get the most from tracing, it's important to understand the terms used, the data they represent and how they work together.
ja: トレースを最大限に活用するには、使用される用語、それらが表すデータ、およびそれらがどのように連携するかを理解することが重要です。

source: In order to see AWS Budget metrics, the requirement for this integration is the permission .
ja: AWS Budgetメトリックスを表示するには、この統合の要件が許可です。

source: In this example, you can see a week's worth of data which makes the day_before data easy to identify.
ja: この例では、day_beforeデータを簡単に識別できる1週間分のデータが表示されます。

source: Install the latest
ja: 最新のものをインストールする

source: Installation
ja: インストール

source: Installing the agent
ja: エージェントのインストール

source: Instrument your application
ja: アプリケーションの計測

source: It also includes support for the following data stores and libraries:
ja: また、次のデータストアとライブラリのサポートも含まれています。

source: It also includes support for the following libraries:
ja: また、次のライブラリのサポートも含まれています。

source: Metadata and resource names have
ja: メタデータとリソース名は、

source: Metrics
ja: メトリックス

source: Naming
ja: 命名規則

source: Next, install the Datadog Tracing library using pip:
ja: 次に、pipを使用してDatadogトレースライブラリをインストールします。

source: Next, install the Go Tracer from the Github repository:
ja: 次に、GithubリポジトリからGo Tracerをインストールします。

source: Next, install the ddtrace gem:
ja: 次に、ddtrace gemをインストールします。

source: Note that options set as environment variables will override the settings defined in the configuration file.
ja: 環境変数として設定されたオプションは、設定ファイルで定義された設定を上書きすることに注意してください。

source: Note that successful delivery does <em>not</em> mean the traces are accepted.
ja: 配信が成功した場合でも、トレースが受け付けられていない時もあるので注意してください。

source: Note: AWS Budget metrics can only be collected from the AWS master account.
ja: 注: AWS Budgetメトリックスは、AWS のマスター アカウントからのみ収集できます。

source: Note: You may send multiple spans within a trace array and each span within a trace should use the same trace_id.
ja: 注：複数のスパンを、単一のトレース配列内で送信することができます。トレース配列内の各スパンには同じtrace_idを使用する必要があります。

source: On the [Graphing Primer](http://docs.datadoghq.com/graphing/) page you will find a list of functions you can apply to a graph.
ja: [Graphing Primer]（http://docs.datadoghq.com/graphing/）ページには、グラフに適用できる関数のリストがあります。

source: On their own, they may not be of high value, but together with the current values they may provide useful insight into the performance of your application.
ja: それ自体では、価値が高いわけではないかもしれませんが、現在の価値と合わせて、アプリケーションのパフォーマンスに有用な情報を提供するかもしれません。

source: Overview
ja: 概要

source: Pro plan members can visit the [APM page of the Datadog app](https://app.datadoghq.com/trace/home) to begin a free 14-day trial.
ja: Proプランのメンバーは、[DatadogアプリのAPMページ]（https://app.datadoghq.com/trace/home）にアクセスして14日間の無料試用を開始できます。

source: Represents a logical unit of work in the system.
ja: システム内の論理作業単位を表します。

source: Resource
ja: リソース

source: Running the agent in Docker
ja: Docker環境でエージェントを実行する

source: Service
ja: サービス

source: Service names and metadata keys are limited to
ja: サービス名とメタデータキーは、

source: Service names and resource names
ja: サービス名とリソース名は、

source: Similarly, tracing metrics are also sent to the Datadog agent.
ja: 同様に、トレースメトリックスもDatadog Agentに送信されます。

source: Span
ja: スパン

source: Spans are associated with a service and optionally a resource.
ja: スパンはサービスおよびオプションでリソースに関連付けられます。

source: The Agent will return a 200 status code and the text "OK" if the service was successfully delivered.
ja: サービスが正常に配信された場合、Agentは200ステータスコードとテキスト「OK」を返します。

source: The Agent will return a 200 status code and the text "OK" if the traces were successfully delivered.
ja: トレースが正常に配信された場合、Agentは200ステータスコードとテキスト「OK」を返します。

source: The Datadog APM is included in our Enterprise plan or as an upgrade to our Pro plan.
ja: Datadog APMは、エンタープライズプランまたはプロプランへのアップグレードとして含まれています。

source: The Datadog Agent uses the file for both infrastructure monitoring and APM configuration options.
ja: Datadog Agentは、このファイルをインフラストラクチャ監視オプションとAPM設定オプションの両方に使用します。

source: The Go integration [source code can be found on Github](https://github.com/DataDog/dd-trace-go).
ja: Go用のインテグレーションの[ソースコードは、Githubで読むことができます]（https://github.com/DataDog/dd-trace-go）。

source: The Python library [source code can be found on Github](https://github.com/DataDog/dd-trace-py).
ja: Python用のライブラリの[ソースコードはGithubにあります]（https://github.com/DataDog/dd-trace-py）。

source: The Ruby integration [source code can be found on Github](https://github.com/DataDog/dd-trace-rb).
ja: Rubyのインテグレーションの[ソースコードは、Githubで読むことができます]（https://github.com/DataDog/dd-trace-rb）。

source: The Tracing backend can track thousands (not millions or billions) of unique resources per service, so resources should be grouped together under a canonical name, like rather than have and as separate resources.
ja: Tracingバックエンドは、サービスごとに数千（百万〜十億ではありません）の個別のリソースを追跡することができます。したがって、リソースは、正規の名前でグループ化する必要があります。

source: The agent accepts requests by binding to 0.0.0.0 (or the appropriate IP address).
ja: Datadog Agentは、0.0.0.0（または適切なIPアドレス）にて、リクエストを待ち受けます。

source: The ddtrace library includes support for a number of web frameworks, including:
ja: ddtraceライブラリは、以下のWebフレームワークのサポートが含まれています。

source: The ddtrace library includes support for the [Ruby on Rails](http://rubyonrails.org/) and [Sinatra](http://www.sinatrarb.com/) web frameworks.
ja: ddtraceのライブラリには、[Ruby on Rails]（http://rubyonrails.org/）と[Sinatra]（http://www.sinatrarb.com/）のWebフレームワークのサポートが含まれています。

source: The default value is .
ja: デフォルト値

source: The following Go libraries are supported:
ja: 以下のGoライブラリがサポートされています：

source: The name of a set of processes that do the same job.
ja: 同じジョブを実行する一連のプロセスの名前。

source: There is a set of functions there of the pattern &lt;timeperiod&gt;_before().
ja: そこには、パターン<timeperiod> _before（）の1組の関数が存在する。

source: These functions will display the values from the corresponding time period on the graph.
ja: これらの関数は、対応する期間の値をグラフに表示します。

source: This not only provides greater visibility, but allows you to see the relationship between application code and the underlying infrastructure.
ja: このことにより、視認性が向上するだけでなく、アプリケーションコードの状態とそのベースインフラストラクチャの関係を簡単に理解できるようになりました。

source: This often happens because of a misconfiguration in Docker environments.
ja: このレコード行は、Docker環境で設定にミスがある場合に頻繁に見かけます。

source: To begin tracing applications written in Go, first [install and configure the Datadog Agent](/tracing#installing-the-agent).
ja: Goで書かれたアプリケーションのトレースを開始するには、最初に[Datadog Agentのインストールと設定]（/ tracing＃installing-the-agent）を実行します。

source: To begin tracing applications written in Python, first [install and configure the Datadog Agent](/tracing#installing-the-agent).
ja: Pythonで書かれたアプリケーションのトレースを開始するには、最初に[Datadog Agentのインストールと設定]（/ tracing＃installing-the-agent）を実行します。

source: To begin tracing applications written in Ruby, first [install and configure the Datadog Agent](/tracing#installing-the-agent).
ja: Rubyで書かれたアプリケーションのトレースを開始するには、最初に[Datadog Agentのインストールと設定]（/ tracing＃installing-the-agent）を実行します。

source: To enable the trace agent add to your file and restart .
ja: トレースエージェントを有効にするには、ファイルに追加し再起動します。

source: To enable tracing:
ja: トレースを有効にするには：

source: To instrument an application written in a language that does not yet have official library support, please reference the [Tracing API](/tracing/api).
ja: 公式ライブラリサポートされていないプログラミング言語で書かれたアプリケーションを計測するには、[Tracing API]（/ tracing / api）を参照してください。

source: To instrument these libraries, please see [the library documentation](http://pypi.datadoghq.com/trace/docs/#other-libraries)
ja: これらのライブラリを設定するには、[traceのライブラリのドキュメント]（http://pypi.datadoghq.com/trace/docs/#other-libraries）を参照してください。

source: To instrument your application, please select one of the following supported languages.
ja: アプリケーションを計測するためには、以下のサポートされているプログラミング言語のいずれかを選択してください。

source: To learn how to instrument these frameworks, please reference [the RubyDoc documentation](http://www.rubydoc.info/gems/ddtrace#Web_Frameworks)
ja: これらのフレームワークからデータを集取する方法については、[The RubyDoc documentation]（http://www.rubydoc.info/gems/ddtrace#Web_Frameworks）を参照してください。

source: To learn how to instrument these frameworks, please reference [the library documentation](http://pypi.datadoghq.com/trace/docs/#web-frameworks)
ja: これらのフレームワークからデータを収集する方法については、[traceのライブラリのドキュメント]（http://pypi.datadoghq.com/trace/docs/#web-frameworks）を参照してください。

source: To trace applications in Docker containers, you can use the [docker-dd-agent](https://hub.docker.com/r/datadog/docker-dd-agent/) image (tagged version 11.0.5110 or higher)and enable tracing by passing as an environment variable.
ja: Dockerコンテナ上のアプリケーションをトレースするには、[docker-dd-agent]（https://hub.docker.com/r/datadog/docker-dd-agent/）イメージ（タグ付きバージョン11.0.5110以上）を使用し、環境変数として渡すことによって可能になります。

source: Trace
ja: トレース

source: Trace agent source code is available on [the Github repo](https://github.com/DataDog/datadog-trace-agent).
ja: トレースエージェントのソースコードは、[Github repo](https://github.com/DataDog/datadog-trace-agent)で閲覧することができます。

source: Trace data is currently being stored for about 36 hours.
ja: トレースデータは、約36時間保存されています。

source: Traces are a list of spans as JSON objects containing the span information:
ja: トレースはスパン情報を含むJSONオブジェクトとしてスパンのリストです：

source: Traces may be dropped after successful delivery.
ja: トレースは、正常に配信された後にドロップされる可能性があります。

source: Tracing data is sent to the Datadog Agent via an HTTP API.
ja: トレースデータは、HTTP APIを介してDatadog Agentに送信されます。

source: Tracing functionality is an opt-in process.
ja: トレース機能はオプトイン プロセスです。

source: Tracing is supported in Docker, but you'll have to make sure:
ja: トレースはDocker環境でもサポートされていますが、以下を確認する必要があります：

source: Tracing is supported in the Datadog Agent for Linux and Docker.
ja: LinuxおよびDockerのDatadog Agentで、トレースをサポートしています。

source: Used to track the time spent by an application processing a single operation.
ja: 単一オペレースオプションを処理するためにアプリケーションが費やした時間を追跡するために使用されます。

source: Verify this by tailing the logs:
ja: ログをtail コマンドで表示してを内容を確認します:

source: Verifying Functionality
ja: 機能の確認

source: Visit [http://chat.datadoghq.com](http://chat.datadoghq.com) to join the Slack.
ja: スラックに参加するには、[http://chat.datadoghq.com]（http://chat.datadoghq.com）をご覧ください。

source: We maintain a list of [community tracing libraries](http://docs.datadoghq.com/libraries/#community-tracing-apm-libraries).
ja: 私たちは[コミュニティトレースライブラリ]（http://docs.datadoghq.com/libraries/#community-tracing-apm-libraries）のリストを維持しています。

source: We provide some [official libraries](/tracing/#instrument-your-application) that simplify sending metrics to the Datadog Agent, however you may want to interact directly with the API to instrument applications that cannot use the libraries or are written in languages that don't yet have an official Datadog Tracing library.
ja: Datadog Agentへのメトリクス送信を簡素化するためにいくつかの[公式ライブラリ]（/ tracing /＃instrument-your-application）を公開していますが、APIを直接使用してライブラリが使用できないアプリケーションや、公式のDatadog Tracingライブラリが存在していないプログラミング言語で書かれたアプリケーションのメトリクスを送信することができます。

source: When tracing is working properly you will see flushed payload messages similar to the following:
ja: トレースが正常に動作していると、tailコマンドで表示した内容に次のような内容が表示されます。

source: With our infrastructure monitoring, metrics are sent to the Datadog Agent, which then forwards them to Datadog.
ja: インフラストラクチャの監視の場合、メトリックスは先ずローカルのDatadog Agentに送信され、その後Datadogのバックエンドに転送されます。

source: You can also reach our APM team via email at [tracehelp@datadoghq.com](mailto:tracehelp@datadoghq.com).
ja: [tracehelp@datadoghq.com]（mailto：tracehelp@datadoghq.com）の電子メールでAPMチームに連絡することもできます。

source: You can find additional documentation on [the GoDoc Package page](https://godoc.org/github.com/DataDog/dd-trace-go/tracer).
ja: [GoDocパッケージのページ]（https://godoc.org/github.com/DataDog/dd-trace-go/tracer）に関する追加のドキュメントがあります。

source: You can find additional documentation on [the RubyDoc Gem page](http://www.rubydoc.info/gems/ddtrace/).
ja: [The RubyDoc Gem page]（http://www.rubydoc.info/gems/ddtrace/）に関する追加のドキュメントがあります。

source: You can find additional documentation on [the library documentation page](http://pypi.datadoghq.com/trace/docs/).
ja: [traceのライブラリのドキュメントページ]（http://pypi.datadoghq.com/trace/docs/）には、追加のドキュメントがあります。

source: You can set the agent binding via in or the DD_BIND_HOST env variable
ja: DD_BIND_HOSTのenv変数を使用してエージェントバインディングを設定できます

source: You may also send multiple traces.
ja: 複数のトレースを送信することもできます。

source: You must also enable billing metrics within the [AWS Console](http://docs.aws.amazon.com/AmazonCloudWatch/latest/monitoring/monitor_estimated_charges_with_cloudwatch.html#turning_on_billing_metrics).
ja: [AWS Console]（http://docs.aws.amazon.com/AmazonCloudWatch/latest/monitoring/monitor_estimated_charges_with_cloudwatch.html#turning_on_billing_metrics）の請求メトリックスを有効にする必要があります。

source: Your application is able to connect to the Agent (by default it submits to localhost).
ja: アプリケーションは、Agentに接続できる必要があります（デフォルトでは、ローカルのコンテナ内にAgent が存在して接続する設定になっています）。

source: agent-1
ja: [fuzzy][fuzzy]エージェント

source: agent-3
ja: [fuzzy]エージェント

source: instances:
ja: [fuzzy]{0} 個のインスタンス毎

source: summary: The month_before() function allows you to overlay data from the previous month on your current data.
ja: summary：month_before（）関数を使用すると、前の月のデータを現在のデータにオーバーレイすることができます。

source: summary: The week_before() function allows you to overlay data from the previous week on your current data.
ja: [fuzzy]summary：month_before（）関数を使用すると、前の月のデータを現在のデータにオーバーレイすることができます。

source: tags:
ja: [fuzzy]タグ(T):

source: | File setting | Env variable | Description | |---|---|---| | **main** | | | | The Datadog Agent will accept trace metrics when the value is set to .
ja: [fuzzy]デフォルト値なし

source: ~~~ Main
ja: [fuzzy]{0} [主]
